tutorials/multiphaseEuler/hydrofoil/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phaseTurbulenceStabilisation
{
    type            phaseTurbulenceStabilisation;

    libs            ("libmultiphaseEulerFvModels.so");

    phase           gas;

    alphaInversion  0.1;
}

cavitation
{
    type            multiphaseEuler::cavitation;
    libs            ("libmultiphaseEulerFvModels.so");

    phases          (liquid gas);

    energySemiImplicit no;

    model           Kunz;

    pSat            79995.75943;

    UInf            5.33;
    tInf            0.028142589;
    Cc              100;
    Cv              100;
}

// ************************************************************************* //
